{
  "_layout": "basic",
  "_path": "/cms/editing-content",
  "title": "Editing content",
  "leading": "The editorial process in Blueprints CMS: create, fine tune, and publish content.",
  "content": [
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "warning",
      "markdown": {
        "raw": "**Blueprints CMS is currently in alpha. It is only available for a small team of internal testers. If you would like to help us test and improve the CMS (and be one of the first ones to get your hands on it), please reach out to our team.**"
      }
    },
    {
      "as": "h2",
      "size": "title",
      "contentComponentId": "blocks.heading",
      "title": "Overview",
      "leading": "Blueprints content management is based on concepts of live version and drafts. It means that there is the live version of content that is currently published and there are drafts to edit the live version. The editorial process starts with creating a new draft, then submitting it for review and finally publishing.",
      "withCopyLink": false,
      "withDivider": false
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "1. **Create a new draft.** To start making changes to the content, you need to create a draft and submit it for review\n\n1. **Edit content.** You can edit as many files as you need in one draft: create new, make changes, delete.\n\n1. **Submit your draft for review.** Once you are ready to share your draft, you can now submit the changes for review. You can still make more changes! This opens a pull request in your GitHub repository to merge the edits you’ve made into the live version.\n\n1. **Merge and publish!** This process takes place outside of Blueprints CMS—in GitHub—and is defined by your development infrastructure and practices. Once your draft is merged into the live version, it should be available on the site or as dictated by your publishing strategy."
      }
    },
    {
      "as": "h3",
      "size": "headline",
      "contentComponentId": "blocks.heading",
      "title": "In technical terms",
      "withCopyLink": false,
      "withDivider": false
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "Blueprints CMS is a Git and GitHub based system. Your live content is the content on the default or main branch of your repository. Each draft creates a new branch off the default branch. Submitting a draft for review opens a pull request."
      }
    },
    {
      "as": "h2",
      "size": "title",
      "contentComponentId": "blocks.heading",
      "title": "Collection and unique documents",
      "withCopyLink": false,
      "withDivider": true
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "Blueprints CMS has two document types: collection and unique. The difference is simple, collection documents are part of one collection and follow the same template. Unique documents are one of a kind and don’t have a template."
      }
    },
    {
      "contentComponentId": "lists.table-list",
      "variant": "borderless",
      "data": [
        ["**Collection**", "Document is a part of a collection, and follows a template. For example, if you have component documentation, your component pages are a collection of documents that follow the same template."],
        ["**Unique**", "Document is one of a kind, and has no template. Content for pages like home, about us, principles, etc. are unique and one of a kind. They do not have a template shared with any other page on the site."]
      ],
      "columnSizing": [1, 4]
    }
  ]
}
