{
  "_layout": "basic",
  "_path": "/cms/introduction",
  "title": "Introduction",
  "leading": "Minimal headless content management system (a.k.a. CMS) for your documentation site.",
  "heroImage": {
    "src": "../../assets/demo-image-2.png",
    "alt": "Demo image 2"
  },
  "content": [
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "warning",
      "markdown": {
        "raw": "**Blueprints CMS is currently in alpha. It is only available for a small team of internal testers. If you would like to help us test and improve the CMS (and be one of the first ones to get your hands on it), please reach out to our team.**"
      }
    },
    {
      "as": "h2",
      "size": "title",
      "contentComponentId": "blocks.heading",
      "title": "About",
      "leading": "Blueprints CMS is a content management system for your documentation site. Our goal is to create a simple, quick to install system to lower the barrier for contributors to write and publish documentation."
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "- **Minimal & quick to install.** Blueprints CMS doesn’t require a database or server to run. It edits content files directly in a repository, either alongside your codebase or in a dedicated documentation site repository. Blueprints CMS installs as a GitHub app into your repository, after which you can create, edit and publish content.\n\n- **Lowers the barriers.** Provides non-technical authors a way to directly contribute the content and assets to the repository.\n\n- **Designed for documentation.** Blueprints CMS is designed for writing documentation."
      }
    },
    {
      "contentComponentId": "tiles.bookmark-tile",
      "to": "/cms/get-started",
      "title": "Get started",
      "isExternal": false,
      "description": "Guide to adding content management to your documentation site."
    },
    {
      "contentComponentId": "tiles.bookmark-tile",
      "to": "mailto:riacarmin@microsoft.com?subject=Request%20access%20to%20Blueprints%20CMS",
      "title": "Request access",
      "isExternal": true,
      "description": "Submit a request to be added to the user alpha testing group."
    }
  ]
}
