{
  "_layout": "basic",
  "_path": "/guidance/component-page-structure",
  "title": "Component page structure ",
  "leading": "",
  "content": [
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "warning",
      "markdown": {
        "raw": "**Note** It’s okay to repeat information in different sections of a component page. For example, something about accessibility may be important enough to include in both the Overview and the Accessibility sections."
      }
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "## Component description \n\n#### First paragraph\n\n**Definition of component and use case(s) [required]**\n\nFirst sentence explains what the component is or does. \n\n\n\n- Component is the subject of the sentence.  \n\n- Use the singular noun form, not plural, in the first Overview sentence, then use the plural noun form. Exception: Use plural noun form in the first Overview sentence when a component is never used alone, for example, Breadcrumbs. \n\n- Use indicative affirmative to convey recommendations and demonstrate flexibility. "
      }
    },
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "info",
      "markdown": {
        "raw": "**Example – singular noun form**\n\n > _A button triggers a single action or event, not Buttons trigger a single action or event._"
      }
    },
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "info",
      "markdown": {
        "raw": "**Example – Select overview**\n\n > _A select lets people choose a single option from a list of at least four options._"
      }
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "Additional sentences provide elaboration."
      }
    },
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "info",
      "markdown": {
        "raw": "**Example – Select overview**\n\n > _Selects use browser-native styling for the listed options._"
      }
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "Last sentence:\n\n- Describes an ideal scenario.\n\n- Imperative affirmative if it’s known best practice.\n\n- Indicative affirmative if it’s a recommendation but not enforceable."
      }
    },
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "info",
      "markdown": {
        "raw": "**Example – Select overview**\n\n > _They’re ideal for data submission in forms and ease of use on mobile platforms._"
      }
    },
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "info",
      "markdown": {
        "raw": "**Example – Button overview**\n\n > _Use buttons for important actions like submitting a response, committing a change, or moving to the next step._"
      }
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "#### Second paragraph\n\n**Instructions when to use a different component**\n\nProvides information about use cases that require a different component.\n\n- Use the plural noun form, not singular, in the second Overview paragraph.\n\n- Describe use cases that the given component doesn’t accomplish."
      }
    },
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "info",
      "markdown": {
        "raw": "**Example – Checkbox overview**\n\n > _Checkboxes don’t trigger an immediate change and require a submission step, like selecting a button._"
      }
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "If a different component is preferred, provide alternatives. When writing “if” conditional sentences, write both clauses in present tense. See “When to use Use vs. Try” to know which verb to use in the second clause. Describe use cases that the given component doesn’t accomplish."
      }
    },
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "info",
      "markdown": {
        "raw": "**Example – Checkbox overview**\n\n > _If you need a component that has immediate effect, try a switch._"
      }
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "Where possible, focus on what someone using your system needs from their audience."
      }
    },
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "info",
      "markdown": {
        "raw": "**Example – Input overview**\n\n > _If you need to collect more than one line of information, use a textarea._"
      }
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "##### When to use Use vs. Try\n\n- When there’s a preferred solution, use the term “use” to convey the preference for that solution."
      }
    },
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "info",
      "markdown": {
        "raw": "**Example – Switch overview**\n\n > _If you need to require a submission step before applying a change or if you need to specify an indeterminate state, use a checkbox._"
      }
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "- When there's more than one viable solution, use the term “try.”"
      }
    },
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "info",
      "markdown": {
        "raw": "**Example – Card nudge overview**\n\n > _Never use a card nudge to convey feedback or status. If you want to communicate how things are going, try a toast or banner notification instead._"
      }
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "## Types\n\nDescribe types of the component that apply to different use cases. No need to include differences in size, orientation, appearance.\n\n First sentence describes what the type does.\n\n- **Indicative affirmative**\n\nSecond sentence instructs when to use it.\n\n- **Imperative affirmative**"
      }
    },
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "info",
      "markdown": {
        "raw": "**Example – Modal dialog**\n\n > _A modal dialog disables the page content behind it and usually obscures or dims it to surface its content. Use it when someone needs to perform a focused task, like signing into an app._"
      }
    },
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "info",
      "markdown": {
        "raw": "**Example – Non-modal dialog**\n\n > _A non-modal dialog allows someone to continue interacting with the page content behind the window and aids in their workflow, like find and replace. Use it as a helper in a task._"
      }
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "## Behavior\n\nDescribes a component’s default and optional behaviors.\n\n- Instructs how to implement optional behaviors such as truncation, overflow, dismissal, validation, requirements, etc.\n\n- Recommends when to use certain behaviors and highlights potential consequences."
      }
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "## Layout\n\nInstructs or recommends how to place a component.\n\n- Description of how it’s styled.\n\n- Description of how it’s placed relative to the IA and other components. "
      }
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "## Accessibility \n\nInstructs or recommends how to use a component accessibly.\n\n- Description of a component’s accessibility properties.\n\n- Description of how to optimize a component for accessibility. "
      }
    },
    {
      "contentComponentId": "blocks.text",
      "markdown": {
        "raw": "## Content \n\nInstructs or recommends how to write UI copy for a component.\n\n- Description of a component’s UI copy needs and what types of content should appear in the component and where. For example, use verbs in buttons to reflect actions. \n\n- Description of UI copy best practices from the Microsoft Writing Style Guide, like include using short sentences or fragments and not using end punctuation. \n\n- Includes links to the Microsoft Writing Style Guide, when helpful."
      }
    },
    {
      "contentComponentId": "blocks.sidenote",
      "variant": "info",
      "markdown": {
        "raw": "**Example – Accordion content**\n\n > _Use sentence-style capitalization—only capitalize the first word. For more info, go to [Capitalization in the Microsoft Writing Style Guide](https://styleguides.azurewebsites.net/Styleguide/Read?id=2700&topicid=33685)._"
      }
    }
  ]
}
